---
kind: property
id: P:Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId1
source: html/97cf9036-a2c3-b6c8-54ee-a0ed54f26b6b.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceMemberDifference.MemberId1 Property

Id of the member in the first assembly

## Syntax (C#)
```csharp
public ElementId MemberId1 { get; }
```